Revit 2027 API
ImagePlacementOptions Constructor
 Constructs a new ImagePlacementOptions that will place an ImageInstance with its center at the origin of the model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImagePlacementOptions()
Public Sub New
public:
ImagePlacementOptions()
new : unit -> ImagePlacementOptions
See Also
Reference
ImagePlacementOptions Class
ImagePlacementOptions Overload
Autodesk.Revit.DB Namespace